#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-QZjbrDkSYiAmxKfS

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_role.ec2_primary: Refreshing state... [id=ec2-primary]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_instance_profile.ec2_primary: Refreshing state... [id=ec2-profile]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_security_group.https: Refreshing state... [id=sg-0a3410176c57a9dcb]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_security_group.postgres: Refreshing state... [id=sg-0e4218e5cefa26b24]
aws_security_group.ssh: Refreshing state... [id=sg-07a113216ea602a4f]
aws_security_group.inbound_http: Refreshing state... [id=sg-0a04ba8fd38ce68c9]
aws_security_group.inbound_https: Refreshing state... [id=sg-0b9c6e22f2a63fce9]
aws_security_group.http: Refreshing state... [id=sg-065a412fecefab781]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
aws_security_group_rule.allow_ephemeral_ssh_return: Refreshing state... [id=sgrule-139332016]
aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1461435279]
aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-2104780721]
aws_security_group_rule.allow_postgres_return: Refreshing state... [id=sgrule-2072332023]
aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3902821458]
aws_security_group_rule.allow_outbound_http_return: Refreshing state... [id=sgrule-4180701166]
aws_security_group_rule.allow_ephemeral_https_return: Refreshing state... [id=sgrule-3088169964]
aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-2231607179]
aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3725321253]
aws_security_group_rule.allow_outbound_https_return: Refreshing state... [id=sgrule-691814140]
aws_security_group_rule.allow_inbound_http: Refreshing state... [id=sgrule-20593255]
aws_security_group_rule.allow_ephemeral_http_return: Refreshing state... [id=sgrule-1480824257]
aws_instance.primary: Refreshing state... [id=i-034f6ba06175e3118]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_policy.ec2_primary: Refreshing state... [id=arn:aws:iam::558855412466:policy/ec2-primary-policy]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
aws_iam_role_policy_attachment.ec2_primary: Refreshing state... [id=ec2-primary-20230806154009241400000001]
aws_eip.primary: Refreshing state... [id=eipalloc-09bdf2f5a06f2d778]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.opentracker-testing will be created
  + resource "aws_route53_record" "opentracker-testing" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "testing"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z03017682LQ8TW5YUFGE0"
    }

  # module.f2_instance.aws_eip.this will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # module.f2_instance.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "main-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "main-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.f2_instance.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Policy for main-role"
      + id          = (known after apply)
      + name        = "main-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::configuration-sfvz2s"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::configuration-sfvz2s/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.f2_instance.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for the main instance"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "main-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.f2_instance.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "main-role"
    }

  # module.f2_instance.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0ab14756db2442499"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "main-instance-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "macbook-m2-pro"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-07936cc0e5c7d83b1"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "448d639777e847cf2baaa38f88f262ac4a836265"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = true
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }
    }

  # module.f2_instance.aws_security_group.inbound_https will be created
  + resource "aws_security_group" "inbound_https" {
      + arn                    = (known after apply)
      + description            = "Allow inbound HTTPS traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-inbound-https"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d1ab7c53aec22955"
    }

  # module.f2_instance.aws_security_group.inbound_ssh will be created
  + resource "aws_security_group" "inbound_ssh" {
      + arn                    = (known after apply)
      + description            = "Allow inbound SSH traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-inbound-ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d1ab7c53aec22955"
    }

  # module.f2_instance.aws_security_group.outbound_http will be created
  + resource "aws_security_group" "outbound_http" {
      + arn                    = (known after apply)
      + description            = "Allow outbound HTTP traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-outbound-http"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d1ab7c53aec22955"
    }

  # module.f2_instance.aws_security_group.outbound_https will be created
  + resource "aws_security_group" "outbound_https" {
      + arn                    = (known after apply)
      + description            = "Allow outbound HTTPS traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-outbound-https"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d1ab7c53aec22955"
    }

  # module.f2_instance.aws_security_group_rule.allow_ephemeral_https_return will be created
  + resource "aws_security_group_rule" "allow_ephemeral_https_return" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ephemeral HTTPS traffic return"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.f2_instance.aws_security_group_rule.allow_ephemeral_outbound_http_return will be created
  + resource "aws_security_group_rule" "allow_ephemeral_outbound_http_return" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ephemeral outbound HTTP traffic return"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.f2_instance.aws_security_group_rule.allow_ephemeral_outbound_https_return will be created
  + resource "aws_security_group_rule" "allow_ephemeral_outbound_https_return" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ephemeral outbound HTTPS traffic return"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.f2_instance.aws_security_group_rule.allow_ephemeral_ssh_return will be created
  + resource "aws_security_group_rule" "allow_ephemeral_ssh_return" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow ephemeral SSH traffic return"
      + from_port                = 1024
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.f2_instance.aws_security_group_rule.allow_inbound_https will be created
  + resource "aws_security_group_rule" "allow_inbound_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow inbound HTTPS from anywhere"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.f2_instance.aws_security_group_rule.allow_inbound_ssh will be created
  + resource "aws_security_group_rule" "allow_inbound_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow inbound SSH from anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.f2_instance.aws_security_group_rule.allow_outbound_http will be created
  + resource "aws_security_group_rule" "allow_outbound_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound HTTP to anywhere"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "egress"
    }

  # module.f2_instance.aws_security_group_rule.allow_outbound_https will be created
  + resource "aws_security_group_rule" "allow_outbound_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound HTTPS to anywhere"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

```

</details>